{"Aer Lingus": [{"opinion": "Aer Lingus are very expensive and keep adding costs even during booking.", "compound": 0.431}, {"opinion": "Great flight over to Manchester. Very quick to board and take off. We were very impressed. ", "compound": 0.431}, {"opinion": "All good", "compound": 0.431}, {"opinion": "no problems .", "compound": 0.431}, {"opinion": "could have being cleared better ", "compound": 0.431}, {"opinion": "Perfect", "compound": 0.431}, {"opinion": "Nice flight ", "compound": 0.431}, {"opinion": "Good leg space compared to other airlines. Fast boarding and crew was very nice. ", "compound": 0.431}, {"opinion": "Very happy with the flight and service.", "compound": 0.431}, {"opinion": "Staff lovely flight on time my friend needed help and they couldn’t have been nicer", "compound": 0.431}, {"opinion": "Excellent", "compound": 0.431}, {"opinion": "Jet blue let us down a small bit but overall thankfully with 3 children(non crying) and mom is a  nervous traveller was fantastic ", "compound": 0.431}, {"opinion": "the turbo prop plane was very noisy on the inside in the cabin.  It was a stressful journey as a result", "compound": 0.431}, {"opinion": "I had to upgrade to business due to breaking my right patella.  It cost over $4000. I was OFFERED AN Upgrade while checking in at Seattle for the flight from Frankfurt to Geneva and that was only $350. ", "compound": 0.431}, {"opinion": "I still think a complimentary cup of coffee or water can be added to their flights. ", "compound": 0.431}], "Air France": [{"opinion": "It was my first bad travelling experience since I was born", "compound": 0.431}, {"opinion": "good experience", "compound": 0.431}, {"opinion": "100% good service a lot of smiling faces..", "compound": 0.431}, {"opinion": "Flight had delay because we had to wait for pilot.", "compound": 0.431}, {"opinion": "This was not an Air France flight.  It was Vietnam Airline.  Because the tickets were purchased via Air France and operated by the National airline, access to seating plans etc were not available.", "compound": 0.431}, {"opinion": "Vol ponctuel mais le prix est eleve pour un aussi court trajet et le service a bord est minimal.", "compound": 0.431}, {"opinion": "Flug Nürnberg - Paris:   Verspätung von 2,5 h  ==>   Anschlußflug trotz einer Zeitlücke in Paris von ursprünglich 2,5 h nicht erreicht!  Lange Wartezeiten an der Umbuchungsstelle  Neuer Flug, wodurch ich ca. 4,5 h verlor  ", "compound": 0.431}], "Air Europa": [{"opinion": "I didn't fly,because the Coronavirus,I asked the cancelation but you did not anything about.At least you could Change the dates of the flight.I have paid,and I could not flight So,very bad service", "compound": 0.431}, {"opinion": "Everything was excellent for my flight from Madrid to Tunis ", "compound": 0.431}, {"opinion": "I m agriat with my flight with your company ", "compound": 0.431}, {"opinion": "Awesome", "compound": 0.431}, {"opinion": "Excellent meal", "compound": 0.431}, {"opinion": "I asked for a seat with more leg room because i am handicap and cant sit in normal seats but even though you said it will be taken care of i wasn't so i had to somehow sit in regular seats which was very very painful to me so it wasn't a comfortable flight.  and could do nothing about it in EA I was able to switch seats because the flight was not full but during my flights in IBERIA it was a very bad experience because they were longer flights and had to sit on regular seats.", "compound": 0.431}], "Aegean Airlines": [{"opinion": "Due to Corona virus i have t cancel my trip and i have not received any compensation from your side", "compound": 0.431}, {"opinion": "Expensive", "compound": 0.431}, {"opinion": "very good service with a smile", "compound": 0.431}, {"opinion": "The flight was ok, an hour delay from Barcelona, however the service was very nice and friendly and the flight itself was nice, I believe a little entertainment such as showing a movie will make the life even better. the food was so little which is an issue I hope the airline can deal with. ", "compound": 0.431}, {"opinion": "Tickets were expensive for this time of the year. But the flight and catering on board as well as the transfer experience were very good.", "compound": 0.431}, {"opinion": "As expected, I've traveled before with the same company,  good flight and very pleasant on-board personnel.   The ONLY company flying to Athens which OFFERS A MEAL!!!!!!   For the client IT IS A BIG PLUS!!!   I definitely recommend AEGEAN and will try to travel only with this company each time I go to Athens. ", "compound": 0.431}, {"opinion": "Very nice trip.", "compound": 0.431}, {"opinion": "The price was higher", "compound": 0.431}, {"opinion": "Everything was great and I enjoyed to the max.", "compound": 0.431}, {"opinion": "Very good place. Extremely clean and renovated rooms. In the centre of the centre of Florence. Few steps in the entrance but were fine as these are typical in the building of Florence.  Beautiful view too. ", "compound": 0.431}], "Aeroflot": [{"opinion": "The Aeroflot did not approve me to get the flight due to the regulations that no one can travel except the Russian, this made a big problem for me, why they approved me to book the flight then when I arrived the airport to make chek in I was told by them that I can't due to new regulations   It was very bad experience .", "compound": 0.431}, {"opinion": "Very nice  flight and good service. ", "compound": 0.431}, {"opinion": "جيد", "compound": 0.431}], "Austrian Airlines": [{"opinion": "Я дал высокую оценку так как был доволен обслуживанием и отзывчивостью девушек.  Я получил/чу деньги за отмену рейса 80 процентов. Но .. причина особенная - короновирус в Израиле и в Европе и возможно можно  было получить более полный возврат или перенос рейса на новые даты?! Если бы этот момент был проверен, было бы ещё лучше. ", "compound": 0.431}, {"opinion": "Very good flexible ", "compound": 0.431}, {"opinion": "Great service, it was a pleasure!", "compound": 0.431}, {"opinion": "No specific suggestions", "compound": 0.431}], "American Airlines": [{"opinion": "We couldn’t fly, the company doesn’t let my brother get on the plane. I am trying to get a refund but it is not possible without eticket nr which I don’t possess.", "compound": 0.431}, {"opinion": "All good", "compound": 0.431}], "Air Malta": [{"opinion": "I was not able to do online check in so we had to queue at the AirMalta checkin desk even we only had hand luggage. Otherwise transit was very smooth and flight on time.", "compound": 0.431}], "Air Canada": [{"opinion": "Very nice and comfortable. ", "compound": 0.431}], "Alitalia": [{"opinion": "Taking into account the corona virus and the advice to travel no more to Italy, I didn't take the flight but did send you a mail to be reimbursed for the trip.  I an extremely surprised to receive this mail of yours.", "compound": 0.431}, {"opinion": "Tutto era ok durante il viaggio, tranne lo stato delle valigie al ritorno, sono uscite tutte sbattute, quella dei nostri amici persino rotta da entrambe le parti. ", "compound": 0.431}, {"opinion": "Flight was comfortable. On the return trip I was offered to board my hand luggage which gave me the opportunity to have a more relaxed flight.   Boarding was smooth and the delivery of the luggage was uneventful. ", "compound": 0.431}, {"opinion": "it was a good trip. thanks you. i am very satisfact.", "compound": 0.431}, {"opinion": "Was able to reserve excellent seats and a short layover. ", "compound": 0.431}, {"opinion": "Wish the food was better", "compound": 0.431}, {"opinion": "Very good ", "compound": 0.431}, {"opinion": "Everything was good.", "compound": 0.431}], "Air India": [{"opinion": "I need to request a refund for the flight as I was wrongly charged for the bookings done", "compound": 0.431}], "Avianca": [{"opinion": "Bad food. No choices to buy.", "compound": 0.431}, {"opinion": "Thought 1st 5 hour flight would have fully reclining seats. The meals were very unimaginative. I asked for lacto vegetarian & I got vegan. Both flights took off over an hour late too", "compound": 0.431}], "Azerbaijan Airlines": [{"opinion": "You did not let me cancel even though we are currently experiencing the corona virus situation. It is sad and probably I would not book with you again ", "compound": 0.431}], "Air Algerie": [{"opinion": "Great service and very helpful staff. ", "compound": 0.431}], "Alaska Airlines": [{"opinion": "Flight was great, attendants  were friendly and helpful. Flights were on time.", "compound": 0.431}], "Air Tahiti Nui": [{"opinion": "Superrr  service ", "compound": 0.431}], "Aerolineas Argentinas": [{"opinion": "Very poor safety checks... seats left upright and no double check on seat belts...", "compound": 0.431}, {"opinion": "The code APP 20 for discount was not accepted when I purchased the ticket. At first My ticket didn’t go through some how and the code was given. 4879135824  ", "compound": 0.431}], "Allegiant Air": [{"opinion": "From check in to sitting in my seat, staff took really great care with me.  I used wheelchair and felt really great about flying your aIRLINE.", "compound": 0.431}], "Air Seychelles": [{"opinion": "Loved it.  Totally different from big planes. Great views.", "compound": 0.431}], "Asiana Airlines": [{"opinion": "Poor entertainment movie catalogue", "compound": 0.431}], "British Airways": [{"opinion": "The food was bad  and two  the was too small ", "compound": 0.431}, {"opinion": "Very staff, well inform agent and last but not least food is 😋 ", "compound": 0.431}, {"opinion": "EL VIAJE FUE PERFECTO, TANTO EN IDA COMO EN REGRESO  ", "compound": 0.431}, {"opinion": "Every detail mstch with our expectation. It was our pleasure traveled with your company. All cabin crew was nice and polnite. ", "compound": 0.431}, {"opinion": "My original return flight from Toronto back to Abuja was cancelled and I was a put on Lufthansa, only to find out that their excess luggage charge was the highest in the industry, $375.00. Needless to say, I was very disappointed as I was neither prepared nor could afford such extra charges. I was given no other choice but to succumb to their demand.", "compound": 0.431}, {"opinion": "Premian ecónomy  ", "compound": 0.431}, {"opinion": "The flight departure time was delayed but no communicated to any of the travellers .    During the check in, the personnel behind the counters kept walking away and never said anything, it was quiet bad. It looked as if they were going for lunch. No one was told anything, it was annoying as it would happen  as you approach the front and the next thing the person walk away. ", "compound": 0.431}], "Brussels Airlines": [{"opinion": "Thank you! Everything was fine 👌", "compound": 0.431}, {"opinion": "The trip was ok, on time and I enjoyed food. The only things bad thing I did not appreciate was about adding luggage, the price was not fix and it was like gumbling. I paid more  on my return trip for just a luggage. ", "compound": 0.431}, {"opinion": "It was OK, no complaints. Perfect!", "compound": 0.431}, {"opinion": "Superb", "compound": 0.431}, {"opinion": "Amazing everything is perfect flight timing same time Brussels Air hostels very nice", "compound": 0.431}], "Bangkok Airways": [{"opinion": "Très bon voyage, avec le petit repas en plus, c'était parfait ! ", "compound": 0.431}, {"opinion": "We flew from Hanoi to Mandalay over Bangkok. There was no problems, all worked perfectly. ", "compound": 0.431}], "Binter Canarias": [{"opinion": "Too expensive for such a short distance", "compound": 0.431}, {"opinion": "My flight was canceled 5 minutes after I bought the flight and I could find no one to help me in the airport. I was distraught and had to buy a flight to Brussels and no to dublin in order to get home. I am try to get a refund obvt", "compound": 0.431}, {"opinion": "perfekto!!!", "compound": 0.431}], "Bahamasair": [{"opinion": "Some how it was great until I return back to marsh harbor abaco checked in early boarded late arrived late and still the leave my bag police uniform hand cuffs boots everything then I have to waite till another day for them to find it in a 21 century country,man ,i need help", "compound": 0.431}], "Croatia Airlines": [{"opinion": "I hav to pay may laguage 2 times.", "compound": 0.431}], "Condor": [{"opinion": "Fantastic   ", "compound": 0.431}], "Copa Airlines": [{"opinion": "pésimo servicio, sobrevenden los vuelos y no entregan soluciones que satisfagan al cliente", "compound": 0.431}], "Corendon Airlines": [{"opinion": "No possibility to book seats electronically", "compound": 0.431}], "China Airlines": [{"opinion": "It was always nice experience with China airlines! The crew, the food and overall experience is great! Keep up the good work! 👍👍❤️", "compound": 0.431}], "China Eastern Airlines": [{"opinion": "It was a bargain deal for me  And the journey was very good and smooth   From booking tiket till the end of the trip. ", "compound": 0.431}], "Delta Air Lines": [{"opinion": "I was nervous about getting bumped but everything went great. ", "compound": 0.431}, {"opinion": "Very good service", "compound": 0.431}, {"opinion": "First time flying with Delta and very impressed with overall service and food provided on flight. Will definitely fly again with them if the price is right. ", "compound": 0.431}], "Eurowings": [{"opinion": "My flyght was cancelled by you,and you ask me how was my trip?you unfilling!", "compound": 0.431}, {"opinion": "Fligth was in time. ", "compound": 0.431}, {"opinion": "I didn't travel. Befor travel date I speek with your office, to send me cancellation mail, till now I didn't get any, and you ask me now for satisfaction? Please send on my mail cancellation that I need for insurence company.  Best regards, Zdenka Ploj", "compound": 0.431}, {"opinion": "Dear,   We booked a ticket for the flight Split-Budapest. But when we came to check in we found out that the flights had been transferred to Zadar and that we needed to get on the bus to go there.  This situation caused us the additional expense of requesting a new transport to Budapest.  Can you please give us some feedback.    ", "compound": 0.431}, {"opinion": "We had to pay 35 euros for handluggage which was right in weight and size, but because it was packed with a tummy by my 16 year old daughter it did not fit in the size rack. So unfair!!", "compound": 0.431}, {"opinion": "Flight cancelled twice but only a Germay number to rep", "compound": 0.431}, {"opinion": "In general  no important problems", "compound": 0.431}, {"opinion": "Generally very good", "compound": 0.431}], "Emirates": [{"opinion": "I love Emirates. Staff are always friendly.       Many thanks ", "compound": 0.431}, {"opinion": "flight attendants were excellent friendly and helpful.... food grand lots of water and juices offered....flight smooth and landed on time....no complaints", "compound": 0.431}, {"opinion": "Great experience,  lovely staff + pleasant staff ", "compound": 0.431}, {"opinion": "To long waiting at Dubai ", "compound": 0.431}], "Etihad Airways": [{"opinion": "Comfortable (with extra leg room selected) Staff friendly and efficient. ", "compound": 0.431}, {"opinion": "Good ", "compound": 0.431}, {"opinion": "All great", "compound": 0.431}, {"opinion": "very expensive compared to my friend who was travelling from Germany - it was less than half price", "compound": 0.431}], "Ethiopian Airlines": [{"opinion": "The ticket was booked to Jhb instead of Durban so I encountered a problem when transiting because it was like I’m coming from local so they said my baggage is over limit", "compound": 0.431}, {"opinion": "Nice comfortable flight", "compound": 0.431}], "Fastjet": [{"opinion": "Checking in was slow and tedious at RG Mugabe International Airport. In service snack quality poor. ", "compound": 0.431}], "Finnair": [{"opinion": "excellent service", "compound": 0.431}], "Garuda Indonesia": [{"opinion": "loved my expierence", "compound": 0.431}], "Iberia": [{"opinion": "You are one of the worst service I’ve ever met for sure you lost a client with me", "compound": 0.431}, {"opinion": "It was cancelled and they won't give me a refund", "compound": 0.431}, {"opinion": "Online chek in great.", "compound": 0.431}], "IndiGo": [{"opinion": "No good", "compound": 0.431}, {"opinion": "Great trip. New and nice aircraft, take off on time and landing  1/2h ahead of schedule. Thanks !", "compound": 0.431}, {"opinion": "all was ok", "compound": 0.431}], "Icelandair": [{"opinion": "Staff are friendly, smooth flight over an back. ", "compound": 0.431}, {"opinion": "It was great flight", "compound": 0.431}, {"opinion": "Everything went great", "compound": 0.431}], "Jetsmart": [{"opinion": "First time that I have used your services, overwhelm surprise!  Got what we agreed, on time and very professional.  Great service!", "compound": 0.431}], "Jeju Air": [{"opinion": "I flew from Narita to Busan with Jeju Airlines and flight was comfortable, customer friendly and no complaints.", "compound": 0.431}], "Kenya Airways": [{"opinion": "very good service staff is soo nice", "compound": 0.431}], "Lufthansa": [{"opinion": "Too expensive ", "compound": 0.431}, {"opinion": "Very comfortable ", "compound": 0.431}, {"opinion": "The service needs to be trained ! Very rude ! Very chaotic ", "compound": 0.431}, {"opinion": "It was a very comfortable flight. Very punctual!", "compound": 0.431}, {"opinion": "Easy to book my flights very good service. I am a frequent flyer. Every two weeks l to work and home. ", "compound": 0.431}, {"opinion": "Group policies to be more transparent on ticket. Terminal personnel should announce which row is for which group and suggest whee to find group on your ticket", "compound": 0.431}, {"opinion": "I was very upset that my ladt flight was cancelled and transferred to another city. In addition I had to take a train, and I had never used a train before and I got lost on the way. It sad terrible. I hope it doesnt happen again", "compound": 0.431}, {"opinion": "It was a nice trip, I think is the best airline ", "compound": 0.431}, {"opinion": "No food served.", "compound": 0.431}, {"opinion": "I did not like the process of buying thicket, somewhere in the middle of it, I realised that I was comunicating to the machine( comp. pogramm) that was very scarry experience, did not like it at all. You should improve it a lot. It has a lack of solutions.", "compound": 0.431}, {"opinion": "Staff at bole airport racists they think all black travelers are illegally trying to get to Europe. No matter you show them all documentations", "compound": 0.431}, {"opinion": "There was a problem with online chek-in and by the time I got to Casablanca airport the check-in for returning flight was already closed. The flight LH1331 from Casablanca to Frankfurt depatured 30 minutes earlier, which makes no sence!", "compound": 0.431}], "LATAM Airlines": [{"opinion": "Amazing!", "compound": 0.431}], "Luxair": [{"opinion": "25th february I received invitation from Luxair to check in for the flight LG6991 26th february at 6.25 AM.  At the counter I realized not only that the flight had been cancelled but, they said, that all my Journey program had been cancelled due to the bankruptcy of AIR ITALY who was charged to execute  the flight EQHDC from Milan Malpensa to Palermo.  Previously on 13th february you informed me  having been taking the necessary steps witg airline in order to request a refund.  I am still awaiting for this.  26th february I had the possibility to buy three places on the flight EasyJet  EJU2672 reservation K1JFK59 at the price of euros 223,16 from Luxembourg to Milan Malpensa in time to fly with EasyJet EJU2807 reservation  K1GNGR6 bought by me in substitution of AIR ITALY tickets.  I ASK YOU THE REIMBURSEMENT OF THE PRICE OF LUXAIR TICKET FROM LUXEMBOURG TO MILAN AND EASYJET TICKET FOR EUROS 223,16 BOUGHT IN SUBSTITUTION.  ", "compound": 0.431}, {"opinion": "Was OK", "compound": 0.431}], "Montenegro Airlines": [{"opinion": "Perfect", "compound": 0.431}], "Malaysia Airlines": [{"opinion": "We had an easy and simple trip from Phuket-KLIA-Kuching. Compliments!", "compound": 0.431}], "Norwegian Air International": [{"opinion": "It is sad to see that You are not up to date about your own flights.  This flight was cancelled.  ", "compound": 0.431}, {"opinion": "Price 496 euro was taking advantage of a shortage of seats in a national emergency.", "compound": 0.431}, {"opinion": "This was not a good flight, we did not go to Las Palmas as the airport was closed, but went to Malaga.  Stayed there for two nights, had to pay for the room and all meals, besides breakfast. Long waiting hours in the plane", "compound": 0.431}, {"opinion": "Nice crew, smiling and helping if needed", "compound": 0.431}, {"opinion": "- plane started one hour too late  -seats were uncofortale  -they didn`nt serve anything free, not even water or a cup of coffee  -announcements were very unclear", "compound": 0.431}, {"opinion": "Thanks is  good ", "compound": 0.431}, {"opinion": "Just ok", "compound": 0.431}], "Nouvelair": [{"opinion": "I wouldn't use this flight  anymore, over two hours late service bad was not worth what I paid for even my family where  not happy, toilets was extremely failth completely disappointed. ", "compound": 0.431}], "Nok Air": [{"opinion": "Flight was delayed and it affected all of our future flights.", "compound": 0.431}], "Olympic Air": [{"opinion": "had to repay my luggage 35.00  when i had already paid you a 23kg bag ", "compound": 0.431}], "Pegasus Airlines": [{"opinion": "My fly was canceled and I didn’t get my money back ", "compound": 0.431}, {"opinion": "They did cancel Our flight for virus corona via sms , they gave Telefon but noboudy answer , I ring to France , Holland , charleroui in Belgium but noboudy answer to us , How we can take our money ? It,s horible service of pegasuz air line , they have not office i go there ", "compound": 0.431}, {"opinion": "Eccellent and efficiant service, very helpfull and pleeasent personell, good facilities.  I had very good experiences on all my flights with your company.  Thank you. ", "compound": 0.431}, {"opinion": "None", "compound": 0.431}, {"opinion": "I bay 300$ weight ", "compound": 0.431}, {"opinion": "Flight canceled, no hotel, no compensations, rebooked for the next day, canceled again. Rebooked for two days later to a different city ", "compound": 0.431}, {"opinion": "Terrible trip with two times of cancellation of flight no normal information at the airport ,24 hours without sleep and buying the third time new tickets with other airline and airport.", "compound": 0.431}, {"opinion": "Fast check in procedures, but we had delay for more than 30 min , but in general it was good .", "compound": 0.431}], "Qatar Airways": [{"opinion": "Excellent travel and alerts. Thank you.", "compound": 0.431}, {"opinion": "Last minute ticket , decent ticket price", "compound": 0.431}, {"opinion": "We all had a lovely flight ad got lots of rest too. Thank you ", "compound": 0.431}, {"opinion": "Perfect travel and staff ! ", "compound": 0.431}, {"opinion": "Very nice services, especialy from Doha -Perth and returrn, first time fly with a big  airplane it was a realy amaizing.   Thanks Qatar airlines", "compound": 0.431}, {"opinion": "The bathroom was disgusting! I needed the loo as I got on the flight before we even took off. The bathroom completely reaked of pee and the floor was really sticky. They obviously didn't clean the bathroom between flights.", "compound": 0.431}, {"opinion": "Some diversity of the meals. The menu is same for months.", "compound": 0.431}, {"opinion": "So happy to fly with Qatar airways thank you so much ", "compound": 0.431}, {"opinion": "Qatar airways is Nice experience for me, the crew very friendly and commadating..qatar airways is Cheaper ticket.. Keep it up. Thanks for wonderful experience. ", "compound": 0.431}], "Ryanair": [{"opinion": "Too expensive ", "compound": 0.431}, {"opinion": "Shannon  Airport poorly  sign posted when inside terminal,  no idication of which check in  to use otherwise ok.", "compound": 0.431}, {"opinion": "Was bad because I had to cancel my holiday because of the situation and had no feed back from ryan air to change my flights", "compound": 0.431}, {"opinion": "More than 4 hours delayed", "compound": 0.431}, {"opinion": "I didn't get the flight I was going for work but was told not to go by my employer 3 hours before take off.", "compound": 0.431}, {"opinion": "Goof day ,I did don't check in my flight because of the Corona virus issues, I wish to ask if I can have a reschedule with little amount", "compound": 0.431}, {"opinion": "Good, offers and trustful app to by tickets", "compound": 0.431}, {"opinion": "Flight was fantastic and staff were friendly and very helpful ", "compound": 0.431}, {"opinion": "Due to the current lock down in France I tried to change my flight but was not blé to even though the flights were available. ", "compound": 0.431}, {"opinion": "No problems with flight, left on time arrived in Athens 25 mins early, cabin crew helpful and polite ", "compound": 0.431}, {"opinion": "I appreciated very good value for money. But I would of paid a lot more to of had a  more comfortable seat & no neck pain for several hours after the flight ", "compound": 0.431}, {"opinion": "this time all th best", "compound": 0.431}, {"opinion": "I always travel with you don't know why some moan ", "compound": 0.431}, {"opinion": "The drinks are too expensive. But the staff was great", "compound": 0.431}, {"opinion": "Last minute booking  and was rather pricey   ", "compound": 0.431}], "Royal Air Maroc": [{"opinion": "Great airline. But airport security, Casablanca, has put me off transiting there ever again", "compound": 0.431}, {"opinion": "Great royal air maroc ", "compound": 0.431}], "South African Airways": [{"opinion": "Pleasant flight", "compound": 0.431}, {"opinion": "Enjoyed the flight and appreciate your good service including reminders of travel day and check in...", "compound": 0.431}, {"opinion": "Great flight overall but I found a squashed perfume box on my luggage when I arrived home,I suspect it was squashed between the Dar Es Salaam and Johannesburg flight,my question is what if I was searched at the airport,I suspect someone stole it from the duty free sales,took the bottle and stashed it  in my bag ,not impressed at all,please check your air hostesses thoroughly ", "compound": 0.431}], "Sky Express": [{"opinion": "It was a good flight. All went well.", "compound": 0.431}], "Sky Airline": [{"opinion": "You as a seller didn’t inform good about the luggage policy so we had extra costs ", "compound": 0.431}], "Singapore Airlines": [{"opinion": "Good service . Nice food and drinks", "compound": 0.431}], "Saudi Arabian Airlines": [{"opinion": "I didn’t travel.I tried to call reservations several times to cancel booking due to the delay of the flight but with no success.", "compound": 0.431}], "Sichuan Airlines": [{"opinion": " I need change my flight  another day", "compound": 0.431}], "Turkish Airlines": [{"opinion": "I thought my flight could be canceled and the crew tried so hard to have the flight for me to go back home. Thank you again and hope they all stay safe.", "compound": 0.431}, {"opinion": "I send to you to cancel my booking immediately after I made the booking ... but no one from your stuff be active with me   I think it's not good for you ", "compound": 0.431}, {"opinion": "It was so pleasant to have a trip to Barcelona with my child.. smoothie and lovely..", "compound": 0.431}, {"opinion": "Happy with service", "compound": 0.431}, {"opinion": "I had to cancel the flight in light of coronavirus outbreak and I am disappointed that I was not given a full refund. ", "compound": 0.431}, {"opinion": "Lifesaving trip", "compound": 0.431}, {"opinion": "Flight on time, food is well good, crews are courteous", "compound": 0.431}, {"opinion": "very good flight with helpful crew", "compound": 0.431}, {"opinion": "Great ", "compound": 0.431}, {"opinion": "Due to coronavirus epidemic, I have cancelled my booking flight to Hong Kong. But even after cancellation, I am receiving this question to review. This is insane. It makes me worried that my booking has not cancelled property. ", "compound": 0.431}, {"opinion": "REALLY FOR ME ITS WILL BE LAST TIME TO DO RESERVATION THROUGH YOUR WEB THAT SURE I DONT GET SERVICE AND LOOS TOO MUCH MONEY .  END ............THANKS ", "compound": 0.431}, {"opinion": "Unfortunately i wasn t advised from airline of the 2 hour difference and missed the plane however turkish airlines offered a new flight hotel transfer, hotel and meal. Thank you Turkish Airlines", "compound": 0.431}, {"opinion": "Food was delicious.", "compound": 0.431}, {"opinion": "Para mí la mejor compañía aerea", "compound": 0.431}, {"opinion": "Turkish is the beast airline!", "compound": 0.431}], "TAP Portugal": [{"opinion": "They dint. Serve meals from Lisbon to London even drinks it’s so bad ", "compound": 0.431}, {"opinion": "Very bad FL we late 2hours to lisbon. And the next flight to Dublin was delayed 2 hours. We missed our flight from Dublin to Kerry.", "compound": 0.431}, {"opinion": "We were issued this ticket and weren’t allowed on the plane.  People issuing tickets while Covid 19 was in place should be checking who is allowed on specific flights.  We lost nearly $3000.  (Price was inflated to take advantage of people in a crisis situation). We will be asking that the price of the flight be refunded to a.s.a.p.  We are seniors on a fixed income and cannot through away money.  We had to buy a ticket on another airline for again an inflated price to get us back to Canada.", "compound": 0.431}, {"opinion": "We canceled our flight due to the coronavirus.  We flew back to the US instead.  We are attempting to get a refund.", "compound": 0.431}, {"opinion": "Not enough time left for sleep", "compound": 0.431}, {"opinion": "Your every thing good", "compound": 0.431}, {"opinion": "Staff very kind and attentive. Liked it a lot!", "compound": 0.431}, {"opinion": "I missed the flight as the gate closed 30 min before, and I was just 100 meters away waiting, no called have been done.  I came 25 min before and they refused me to board, maybe the aircraft was by bus far away from the terminal ….  How can I be reimboursed ?  ", "compound": 0.431}, {"opinion": "More than 6 hour delay when we came back to Spain, and they didn’t even give us something to drink or anything", "compound": 0.431}, {"opinion": "Not proffessionel at all", "compound": 0.431}, {"opinion": "Plenty of leg room", "compound": 0.431}, {"opinion": "75minutes delay in a flihgt that occurs every 2 hours !.....", "compound": 0.431}, {"opinion": "Our flight was cancelled and we didn't arrive home on New Year's Eve. The TAP webpage is causing real problems for writing our complaint and after trying for 5 hours I still haven't succeeded.", "compound": 0.431}, {"opinion": "8 hours delayed arrival.   1 additional flight Porto-Lisbon.     Propose no other option if flight for customers. ", "compound": 0.431}, {"opinion": "Was all good but unfortunatly, my travel back to Portugal,  the timings I've receiving from you weren't the same as the TAP timings. If was by your timings I still would be in Brazil.   My flight was at 17h10 ( Brazil hour) and by your msh my flight would be at 22h...   ", "compound": 0.431}], "Tarom": [{"opinion": "My luggage never reached Jeddah", "compound": 0.431}, {"opinion": "The booking if my flight wasn't in the register. We were forced to seat in middle seats. ", "compound": 0.431}, {"opinion": "I had a two hours and a half delay in Belgrade. Good price though ", "compound": 0.431}], "Transavia France": [{"opinion": "Nice trip - friendly stuff - accurate time schedule", "compound": 0.431}, {"opinion": "Too many changes to board ", "compound": 0.431}, {"opinion": "The airplane was late without informations at airport", "compound": 0.431}], "TUI fly": [{"opinion": "Nothing to say,, all perfect ", "compound": 0.431}, {"opinion": "No observations, everything was alright", "compound": 0.431}, {"opinion": "Good flight!", "compound": 0.431}], "Tunisair": [{"opinion": "Time management should be performed", "compound": 0.431}, {"opinion": "The big problem was delay  It is not on time  I wait 3 hours  TUN.   CAI.  & I wait 2 hours CAI. TUN", "compound": 0.431}, {"opinion": "Poor experience   Actually the worst ever", "compound": 0.431}, {"opinion": "Really it was so bad flight because I missed my other flight to libya ,, ", "compound": 0.431}], "Tunisair Express": [{"opinion": "flight was on time, aircraft clean and brand new, noise level is very low compared to previous experience with truboprops, cabin crew were good, overall service was good, I will travel with them again if travelling this route.", "compound": 0.431}], "Thai AirAsia": [{"opinion": "No problems at all. Left and arrived ahead of schedule.", "compound": 0.431}, {"opinion": "Everything was very good! I liked my travelling. The flight was quick and safe.", "compound": 0.431}, {"opinion": "Flight was delayed a bit but everything was smoothly organised.", "compound": 0.431}, {"opinion": "Great flight with a bit delay:)", "compound": 0.431}, {"opinion": "Not on time! Delayed 1 hour and didn't get any extra!", "compound": 0.431}], "Thai Vietjet Air": [{"opinion": "Very good", "compound": 0.431}], "TUI Airways": [{"opinion": "We did not fly with Britannia Airways", "compound": 0.431}, {"opinion": "Very efficient.  Easy booking. Good flight experience", "compound": 0.431}], "Thai Airways": [{"opinion": "Good flight,on time and good service", "compound": 0.431}, {"opinion": "Flight gate was changed late and only a hand written note on original gate displayed new gate. Very easy to miss flight if not on the ball", "compound": 0.431}], "United Airlines": [{"opinion": "Two meals on a 10 hour flight is not enough, everyone was very hungry. ", "compound": 0.431}, {"opinion": "Very good service with my changing flight.", "compound": 0.431}, {"opinion": "Did not enjoy EW when you arrive from abroad that you have to go through the bid line for security, very unfriendly employes at the airport. The airline is great but gound personel very rude and not friendly.", "compound": 0.431}, {"opinion": "Was super ", "compound": 0.431}, {"opinion": "Great service ", "compound": 0.431}, {"opinion": "6.5 trip without any meal, it's just a scam ", "compound": 0.431}], "Vueling": [{"opinion": "I did not fly ad the flight was cancelled and I haven’t yet received my refund!", "compound": 0.431}, {"opinion": "Because of sandstorm our flight from Barcelona to Lanzarote ( 23.02. ) was canceled. We have got new flight scheduled for 29.02. a day after we plan ta return. It was very bad experience.", "compound": 0.431}, {"opinion": "Very nice", "compound": 0.431}, {"opinion": "The price was very high; the same price for my one-year-old baby who was traveling on my knees.  Although I had paid additional 80EUR for my lagguage, it has got lost and I still do not have it 4 days after the trip.", "compound": 0.431}, {"opinion": "excellent service", "compound": 0.431}, {"opinion": "Great service!", "compound": 0.431}, {"opinion": "Nice with nice mil.", "compound": 0.431}, {"opinion": "Tickets a bit expensive", "compound": 0.431}, {"opinion": "The flight from FCO to TIA is always having a +40 mins delay, like the transit hours aren’t enough.", "compound": 0.431}], "VivaAerobus": [{"opinion": "good service", "compound": 0.431}], "Virgin Australia": [{"opinion": "Everything was great, booking online, registering, the flight, everything!", "compound": 0.431}, {"opinion": "I really appreciate the warm welcome of the staff .   Thank you to all the staff I will come back soon .", "compound": 0.431}], "Wizz Air UK": [{"opinion": "My flight was canceled   And now I can’t refunds payment", "compound": 0.431}, {"opinion": "My flight was cancelled and I was not notified. I’ve been trying to reach someone for days regarding a refund and no one helping me sort this. Fraud company", "compound": 0.431}, {"opinion": "The best. Good time nice trip.  Thank you very much.", "compound": 0.431}]}